#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-SCdCQpFrnxFreiPr

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=c4c04be777c6d672ec2032ef5545cd702046bc6d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210823082831107200000001]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210823103031108700000001]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakE0TXprMU5Wb1hEVE14TURneU1EQTRNemsxTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTjMyCkJyOGo3N0l3YjhtZVhnMDFmUFU0MFdLR0o5YldBbVE3bDNrZkVwSnhuY3VZMjB5UlhCbmx1bGQyZTZpRm9iUHEKV1NMSGRESHlXeUZ4YkpBYmJncDBFbDlOUk1MdXBGL3ZSV2FIVGYzejcxN2l0NDVlRDRzOUVLNiswSGhPdlRLMAoySWc1VVlXbDV4V0g3ZTU3SU9URmFxS01QdEVFRTZPc2EzbDJuSDkxcy9uNEJJOGxhMjlTRnlsbmxRSmluV1dGCndYY21MZW5OM0ttUjVyaS96c243OFBDQlVzTlRiZlpUZHNzRmdDdHdYS05qMTlzWDVIcEpkY3lWOGNaVE9GMDgKZVBUQWZvcGNoMkgrS1Rta1hIYW9jVVdCMWpoTThUaGlkMGdCMGJaZFpjcTRpMFdDZEcydFJHUmkzUm1IS1MzdwpmRU5YU0w1SVJvRmpvZXFMRkY4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKT29UbEF6VjFZb3RTQ3VzeFBRcnFGeEFlK1BNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBV0JNc05ZSUt4WnVReEhGYXFldkpydUwydFZqdytxSloycWxDbUh0b1MwdHJ6WHEwQgpnaGtOZmRWekdmMldTNFJJSjJHbUxFQWtFNkh2RnFjTjFHZnFuUjRESXZYdkQ1S1VyV3lFbFBoTnVKZDJJanVhClBmamZTQXBZM3NDb091S2hLSG5ZN3pWaTUyajJkZ05wOGhUcVlMWjROQXZsbUdlSFRpZVJNRTdWT2JlUmR4VzIKMFo2QXZoOVYxV3p2R1NKZUhKQ0Z2VWZEWWF5eVJIRGxRYmJBaTg5UGFLMlZCMExsU3ArMTc3WG1WOWZTTFArZApIWHNFY2I2c0V3S1JnWWJiaWlwaTY2R0hEakFEa3kzb25pR3l1MUdyU2tNTEs2emNWRHB4WG5NSGdTbmZ0QWhtCjVRSDRPQ0RMa1UrOTFHWkE5YjRxeG5CRzBGSzJzdVJCWndEdwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-22 08:33:55.258 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/9DA9BFD5039C02838233DC7B710ECBD1"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "training"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-0f6630f305d6aef7c"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - subnet_ids                = [
                  - "subnet-00dd6ad17f28e0110",
                  - "subnet-02b7b75b8875b6f02",
                  - "subnet-06dff361d9daa34ea",
                  - "subnet-073345847327cab44",
                  - "subnet-0a134ea213c4bf0e2",
                  - "subnet-0aff3cd4393d112eb",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIxMDgyMjA4Mzk1NVoXDTMxMDgyMDA4Mzk1NVowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAN32
            Br8j77Iwb8meXg01fPU40WKGJ9bWAmQ7l3kfEpJxncuY20yRXBnluld2e6iFobPq
            WSLHdDHyWyFxbJAbbgp0El9NRMLupF/vRWaHTf3z717it45eD4s9EK6+0HhOvTK0
            2Ig5UYWl5xWH7e57IOTFaqKMPtEEE6Osa3l2nH91s/n4BI8la29SFylnlQJinWWF
            wXcmLenN3KmR5ri/zsn78PCBUsNTbfZTdssFgCtwXKNj19sX5HpJdcyV8cZTOF08
            ePTAfopch2H+KTmkXHaocUWB1jhM8Thid0gB0bZdZcq4i0WCdG2tRGRi3RmHKS3w
            fENXSL5IRoFjoeqLFF8CAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFJOoTlAzV1YotSCusxPQrqFxAe+PMA0GCSqGSIb3
            DQEBCwUAA4IBAQAWBMsNYIKxZuQxHFaqevJruL2tVjw+qJZ2qlCmHtoS0trzXq0B
            ghkNfdVzGf2WS4RIJ2GmLEAkE6HvFqcN1GfqnR4DIvXvD5KUrWyElPhNuJd2Ijua
            PfjfSApY3sCoOuKhKHnY7zVi52j2dgNp8hTqYLZ4NAvlmGeHTieRME7VObeRdxW2
            0Z6Avh9V1WzvGSJeHJCFvUfDYayyRHDlQbbAi89PaK2VB0LlSp+177XmV9fSLP+d
            HXsEcb6sEwKRgYbbiipi66GHDjADky3oniGyu1GrSkMLK6zcVDpxXnMHgSnftAhm
            5QH4OCDLkU+91GZA9b4qxnBG0FK2suRBZwDw
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id               = "https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Mon, 23 Aug 2021 10:29:45 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "0aae5090-41f5-4638-97d7-c8d1c4dc2fb3"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "03f76894-6700-407c-90a4-d44d1357fd58"
        } -> (known after apply)
      ~ url              = "https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210823082831107200000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ vpc_zone_identifier       = [
          - "subnet-02b7b75b8875b6f02",
          - "subnet-06dff361d9daa34ea",
          - "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210823103031108700000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ vpc_zone_identifier       = [
          - "subnet-02b7b75b8875b6f02",
          - "subnet-06dff361d9daa34ea",
          - "subnet-0a134ea213c4bf0e2",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakE0TXprMU5Wb1hEVE14TURneU1EQTRNemsxTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTjMyCkJyOGo3N0l3YjhtZVhnMDFmUFU0MFdLR0o5YldBbVE3bDNrZkVwSnhuY3VZMjB5UlhCbmx1bGQyZTZpRm9iUHEKV1NMSGRESHlXeUZ4YkpBYmJncDBFbDlOUk1MdXBGL3ZSV2FIVGYzejcxN2l0NDVlRDRzOUVLNiswSGhPdlRLMAoySWc1VVlXbDV4V0g3ZTU3SU9URmFxS01QdEVFRTZPc2EzbDJuSDkxcy9uNEJJOGxhMjlTRnlsbmxRSmluV1dGCndYY21MZW5OM0ttUjVyaS96c243OFBDQlVzTlRiZlpUZHNzRmdDdHdYS05qMTlzWDVIcEpkY3lWOGNaVE9GMDgKZVBUQWZvcGNoMkgrS1Rta1hIYW9jVVdCMWpoTThUaGlkMGdCMGJaZFpjcTRpMFdDZEcydFJHUmkzUm1IS1MzdwpmRU5YU0w1SVJvRmpvZXFMRkY4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKT29UbEF6VjFZb3RTQ3VzeFBRcnFGeEFlK1BNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBV0JNc05ZSUt4WnVReEhGYXFldkpydUwydFZqdytxSloycWxDbUh0b1MwdHJ6WHEwQgpnaGtOZmRWekdmMldTNFJJSjJHbUxFQWtFNkh2RnFjTjFHZnFuUjRESXZYdkQ1S1VyV3lFbFBoTnVKZDJJanVhClBmamZTQXBZM3NDb091S2hLSG5ZN3pWaTUyajJkZ05wOGhUcVlMWjROQXZsbUdlSFRpZVJNRTdWT2JlUmR4VzIKMFo2QXZoOVYxV3p2R1NKZUhKQ0Z2VWZEWWF5eVJIRGxRYmJBaTg5UGFLMlZCMExsU3ArMTc3WG1WOWZTTFArZApIWHNFY2I2c0V3S1JnWWJiaWlwaTY2R0hEakFEa3kzb25pR3l1MUdyU2tNTEs2emNWRHB4WG5NSGdTbmZ0QWhtCjVRSDRPQ0RMa1UrOTFHWkE5YjRxeG5CRzBGSzJzdVJCWndEdwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-22 08:33:55.258 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/9DA9BFD5039C02838233DC7B710ECBD1"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Environment" = "training"
        }
        # (3 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0f6630f305d6aef7c" -> (known after apply)
          ~ subnet_ids                = [ # forces replacement
              - "subnet-02b7b75b8875b6f02",
              - "subnet-06dff361d9daa34ea",
              - "subnet-0a134ea213c4bf0e2",
                # (3 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:99cdf55a-b41e-4e9a-bfab-3575d7c92510:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210823082831107200000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210823082831107200000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210823082831107200000001" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRTBUWHByTVU1V2IxaEVWRTE0VFVSbmVVMUVRVFJOZW1zeFRsWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGpNeUNrSnlPR28zTjBsM1lqaHRaVmhuTURGbVVGVTBNRmRMUjBvNVlsZEJiVkUzYkROclprVndTbmh1WTNWWk1qQjVVbGhDYm14MWJHUXlaVFpwUm05aVVIRUtWMU5NU0dSRVNIbFhlVVo0WWtwQlltSm5jREJGYkRsT1VrMU1kWEJHTDNaU1YyRklWR1l6ZWpjeE4ybDBORFZsUkRSek9VVkxOaXN3U0doUGRsUkxNQW95U1djMVZWbFhiRFY0VjBnM1pUVTNTVTlVUm1GeFMwMVFkRVZGUlRaUGMyRXpiREp1U0RreGN5OXVORUpKT0d4aE1qbFRSbmxzYm14UlNtbHVWMWRHQ25kWVkyMU1aVzVPTTB0dFVqVnlhUzk2YzI0M09GQkRRbFZ6VGxSaVpscFVaSE56Um1kRGRIZFlTMDVxTVRseldEVkljRXBrWTNsV09HTmFWRTlHTURnS1pWQlVRV1p2Y0dOb01rZ3JTMVJ0YTFoSVlXOWpWVmRDTVdwb1RUaFVhR2xrTUdkQ01HSmFaRnBqY1RScE1GZERaRWN5ZEZKSFVta3pVbTFJUzFNemR3cG1SVTVZVTB3MVNWSnZSbXB2WlhGTVJrWTRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktUMjlVYkVGNlZqRlpiM1JUUTNWemVGQlJjbkZHZUVGbEsxQk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJWMEpOYzA1WlNVdDRXblZSZUVoR1lYRmxka3B5ZFV3eWRGWnFkeXR4U2xveWNXeERiVWgwYjFNd2RISjZXSEV3UWdwbmFHdE9abVJXZWtkbU1sZFRORkpKU2pKSGJVeEZRV3RGTmtoMlJuRmpUakZIWm5GdVVqUkVTWFpZZGtRMVMxVnlWM2xGYkZCb1RuVktaREpKYW5WaENsQm1hbVpUUVhCWk0zTkRiMDkxUzJoTFNHNVpOM3BXYVRVeWFqSmtaMDV3T0doVWNWbE1XalJPUVhac2JVZGxTRlJwWlZKTlJUZFdUMkpsVW1SNFZ6SUtNRm8yUVhab09WWXhWM3AyUjFOS1pVaEtRMFoyVldaRVdXRjVlVkpJUkd4UlltSkJhVGc1VUdGTE1sWkNNRXhzVTNBck1UYzNXRzFXT1daVFRGQXJaQXBJV0hORlkySTJjMFYzUzFKbldXSmlhV2x3YVRZMlIwaEVha0ZFYTNremIyNXBSM2wxTVVkeVUydE5URXMyZW1OV1JIQjRXRzVOU0dkVGJtWjBRV2h0Q2pWUlNEUlBRMFJNYTFVck9URkhXa0U1WWpSeGVHNUNSekJHU3pKemRWSkNXbmRFZHdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vOURBOUJGRDUwMzlDMDI4MzgyMzNEQzdCNzEwRUNCRDEuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:ea457039-af10-45d0-b0cb-1304c060dcfa:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210823103031108700000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210823103031108700000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210823103031108700000001" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRTBUWHByTVU1V2IxaEVWRTE0VFVSbmVVMUVRVFJOZW1zeFRsWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGpNeUNrSnlPR28zTjBsM1lqaHRaVmhuTURGbVVGVTBNRmRMUjBvNVlsZEJiVkUzYkROclprVndTbmh1WTNWWk1qQjVVbGhDYm14MWJHUXlaVFpwUm05aVVIRUtWMU5NU0dSRVNIbFhlVVo0WWtwQlltSm5jREJGYkRsT1VrMU1kWEJHTDNaU1YyRklWR1l6ZWpjeE4ybDBORFZsUkRSek9VVkxOaXN3U0doUGRsUkxNQW95U1djMVZWbFhiRFY0VjBnM1pUVTNTVTlVUm1GeFMwMVFkRVZGUlRaUGMyRXpiREp1U0RreGN5OXVORUpKT0d4aE1qbFRSbmxzYm14UlNtbHVWMWRHQ25kWVkyMU1aVzVPTTB0dFVqVnlhUzk2YzI0M09GQkRRbFZ6VGxSaVpscFVaSE56Um1kRGRIZFlTMDVxTVRseldEVkljRXBrWTNsV09HTmFWRTlHTURnS1pWQlVRV1p2Y0dOb01rZ3JTMVJ0YTFoSVlXOWpWVmRDTVdwb1RUaFVhR2xrTUdkQ01HSmFaRnBqY1RScE1GZERaRWN5ZEZKSFVta3pVbTFJUzFNemR3cG1SVTVZVTB3MVNWSnZSbXB2WlhGTVJrWTRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktUMjlVYkVGNlZqRlpiM1JUUTNWemVGQlJjbkZHZUVGbEsxQk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJWMEpOYzA1WlNVdDRXblZSZUVoR1lYRmxka3B5ZFV3eWRGWnFkeXR4U2xveWNXeERiVWgwYjFNd2RISjZXSEV3UWdwbmFHdE9abVJXZWtkbU1sZFRORkpKU2pKSGJVeEZRV3RGTmtoMlJuRmpUakZIWm5GdVVqUkVTWFpZZGtRMVMxVnlWM2xGYkZCb1RuVktaREpKYW5WaENsQm1hbVpUUVhCWk0zTkRiMDkxUzJoTFNHNVpOM3BXYVRVeWFqSmtaMDV3T0doVWNWbE1XalJPUVhac2JVZGxTRlJwWlZKTlJUZFdUMkpsVW1SNFZ6SUtNRm8yUVhab09WWXhWM3AyUjFOS1pVaEtRMFoyVldaRVdXRjVlVkpJUkd4UlltSkJhVGc1VUdGTE1sWkNNRXhzVTNBck1UYzNXRzFXT1daVFRGQXJaQXBJV0hORlkySTJjMFYzUzFKbldXSmlhV2x3YVRZMlIwaEVha0ZFYTNremIyNXBSM2wxTVVkeVUydE5URXMyZW1OV1JIQjRXRzVOU0dkVGJtWjBRV2h0Q2pWUlNEUlBRMFJNYTFVck9URkhXa0U1WWpSeGVHNUNSekJHU3pKemRWSkNXbmRFZHdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vOURBOUJGRDUwMzlDMDI4MzgyMzNEQzdCNzEwRUNCRDEuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822084331718600000007"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 5 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = {} -> null
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ annotations      = {} -> null
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "561" -> (known after apply)
                  ~ uid              = "4d1f82de-d09e-4751-99f6-207c42a74767" -> (known after apply)
                    # (3 unchanged elements hidden)
                },
            ]
            # (1 unchanged element hidden)
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakE0TXprMU5Wb1hEVE14TURneU1EQTRNemsxTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTjMyCkJyOGo3N0l3YjhtZVhnMDFmUFU0MFdLR0o5YldBbVE3bDNrZkVwSnhuY3VZMjB5UlhCbmx1bGQyZTZpRm9iUHEKV1NMSGRESHlXeUZ4YkpBYmJncDBFbDlOUk1MdXBGL3ZSV2FIVGYzejcxN2l0NDVlRDRzOUVLNiswSGhPdlRLMAoySWc1VVlXbDV4V0g3ZTU3SU9URmFxS01QdEVFRTZPc2EzbDJuSDkxcy9uNEJJOGxhMjlTRnlsbmxRSmluV1dGCndYY21MZW5OM0ttUjVyaS96c243OFBDQlVzTlRiZlpUZHNzRmdDdHdYS05qMTlzWDVIcEpkY3lWOGNaVE9GMDgKZVBUQWZvcGNoMkgrS1Rta1hIYW9jVVdCMWpoTThUaGlkMGdCMGJaZFpjcTRpMFdDZEcydFJHUmkzUm1IS1MzdwpmRU5YU0w1SVJvRmpvZXFMRkY4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKT29UbEF6VjFZb3RTQ3VzeFBRcnFGeEFlK1BNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBV0JNc05ZSUt4WnVReEhGYXFldkpydUwydFZqdytxSloycWxDbUh0b1MwdHJ6WHEwQgpnaGtOZmRWekdmMldTNFJJSjJHbUxFQWtFNkh2RnFjTjFHZnFuUjRESXZYdkQ1S1VyV3lFbFBoTnVKZDJJanVhClBmamZTQXBZM3NDb091S2hLSG5ZN3pWaTUyajJkZ05wOGhUcVlMWjROQXZsbUdlSFRpZVJNRTdWT2JlUmR4VzIKMFo2QXZoOVYxV3p2R1NKZUhKQ0Z2VWZEWWF5eVJIRGxRYmJBaTg5UGFLMlZCMExsU3ArMTc3WG1WOWZTTFArZApIWHNFY2I2c0V3S1JnWWJiaWlwaTY2R0hEakFEa3kzb25pR3l1MUdyU2tNTEs2emNWRHB4WG5NSGdTbmZ0QWhtCjVRSDRPQ0RMa1UrOTFHWkE5YjRxeG5CRzBGSzJzdVJCWndEdwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*